#include <stdio.h>
#include <stdbool.h>
#include <math.h>

// 소수 판별 함수
bool isPrime(long long num) {
    if (num <= 1) {
        return false; // 1 이하의 숫자는 소수가 아님
    }
    
    if (num <= 3) {
        return true; // 2와 3은 소수
    }
    
    if (num % 2 == 0 || num % 3 == 0) {
        return false; // 2 또는 3으로 나누어지면 소수가 아님
    }
    
    // 5부터 시작하여 6씩 증가하면서 소수 여부를 검사
    for (long long i = 5; i * i <= num; i += 6) {
        if (num % i == 0 || num % (i + 2) == 0) {
            
            return false;
        }
    }
    
    return true;
}

int main() {
    // 입력된 숫자들 배열
    // long long numbers[] = {
    //     847727320LL, 133991953LL, 133991953LL, 67937821568971998LL,
    //     17104233164987789LL, 17104233164987789LL, 86350739535410798LL,
    //     86350739535410798LL, 92526820899164725LL, 38676058534288658LL,
    //     38676058534288658LL, 33581832356427380LL, 33581832356427380LL,
    //     87760754759950837LL, 58499849101272797LL, 58499849101272797LL,
    //     43941854396454909LL, 43941854396454909LL, 28267471453467101LL,
    //     17445963011468150LL, 17445963011468150LL,260479487
    // };
    // long long numbers[] = {
    //     926813392, 148815409, 148815409, 518171698, 260479487, 260479487,
    //     847727320, 133991953, 133991953,679378215689,171042331649,335818323563};
    double numbers[] = {679378215689.71998, 171042331649.87789,
        171042331649.87789, 863507395354.10798, 863507395354.10798,
        925268208991.64725, 386760585342.88658, 386760585342.88658,
        335818323564.2738, 335818323564.2738, 877607547599.50837,
        584998491012.72797, 584998491012.72797, 439418543964.54909,
        439418543964.54909, 282674714534.67101, 174459630114.6815,
        174459630114.6815
    };

    int numCount = sizeof(numbers) / sizeof(numbers[0]);

    for (int i = 0; i < numCount; i++) {
        if (isPrime(numbers[i])) {
            printf("%lld is prime.\n", numbers[i]);
        } else {
            printf("%lld is not prime.\n", numbers[i]);
        }
    }

    return 0;
}
